# Mamba3Yolo-T.yaml
# Tiny variant – ~6M params target. Drop-in style for Ultralytics / Mamba-YOLO.

# Parameters
nc: 80  # number of classes (COCO)
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # for T we use 'n' style scaling

# Backbone (ODMamba3)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2  SimpleStem-like
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, Mamba3ODSSBlock, [128, 64, 2, 64, True, 4]]  # dim, d_state, expand, headdim, is_mimo, mimo_rank
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, Mamba3ODSSBlock, [256, 64, 2, 64, True, 4]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, Mamba3ODSSBlock, [512, 64, 2, 64, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, Mamba3ODSSBlock, [1024, 64, 2, 64, True, 4]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head (PAFPN style with Mamba3ODSS)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, Mamba3ODSSBlock, [512, 64, 2, 64, True, 4]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, Mamba3ODSSBlock, [256, 64, 2, 64, True, 4]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 1, Mamba3ODSSBlock, [512, 64, 2, 64, True, 4]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 1, Mamba3ODSSBlock, [1024, 64, 2, 64, True, 4]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
